tutorial/Allrun
#!/bin/bash

rm -rf 0

cp -r 0.orig 0

blockMesh > log.blockMesh
porousCapillaryFoam > log.porousCapillaryFoam
