tutorial/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousCapillaryFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         15000;

deltaT          1e-5;

//writeControl    runTime;

//writeControl    timeStep;

//writeInterval   100;
writeControl    adjustable;

writeInterval   200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

adjusttableRunTime  yes;

maxCo           0.1;

maxDeltaT       1;

functions
{
    #include "alphaMeanFO"
}



// ************************************************************************* //
