tutorial/system/setFieldsDict
/*--------------------------------*- dictionary -*--------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Version: 2306
    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.electrolyte 0
);

regions
(
    boxToCell
    {
        box (0 0 0) (0.030 0.001 0.001);
        fieldValues
        (
            volScalarFieldValue alpha.electrolyte 1
        );
    }
);
